



# 点击左上返回
BACK_CLOSE = [24,124,240,480]
BACK_CLOSE_Color = "100,172,#F9F1F3|61,205,#F9F1F4|100,242,#FBF1F4|110,208,#FFFFFF"


# 小红点
RED_Color = "497,278,#F44381|507,278,#F54381|486,295,#F44381|517,294,#F44381|495,308,#F44381|509,309,#F54381"


# 取消，关闭
X_CLOSE = [611,2344,658,2391]
X_POP = X_CLOSE
X_POP_AN= [597,2568,669,2641]
X_CLOSE_Color = "617,2350,#FFFFFF|644,2349,#FFFFFF|617,2376,#FEFEFE|645,2376,#FEFEFE"
X_POP_Color = X_CLOSE_Color
X_POP_AN_Color = X_CLOSE_Color


# 恭喜获得
A_GET = [55,662,583,1227]

# 确定退出？
A_CLOSEGAME = [415,1305,692,1415]

A_CANCEL = [283,1518,486,1603]

# 头像
A_ICON = [69,160,147,229]
# 点击元气使用
yuanqishiyong = [965, 1335, 1098, 1396]
yuanqishibie = [521,1640,615,1693]
# 点击兑换 * 20，双击
yuanqiduihuan = [954, 1627, 1097, 1700]

# 点击开始
A_Click_Start = [492,2298,761,2394]
A_Load = []


# 日程
rich_yijianlq = [805,2213,1110,2287]

rich_HUOYUEDU = [2,725,1249,977]

rich_ZHOUHUOYUE = [65,2212,633,2461]
rich_ZHOUHUOYUE_A = [10,548,1195,2382]










# 福利
A_BENEFITS = [10,315,194,518]

A_BENEFITS_QIANDAO = [15,382,343,533]
# 每日签到奖励
A_fuli_qiandao = [46,2131,1221,2751]
# 玩呐礼包奖励
A_fuli_qiandaolibao = [971,1771,1183,2074]

# 每日体力
A_BENEFITS_TILI = [279,369,669,541]
A_TILI_1 = [554,2536,825,2620]
A_TILI_2 = [918,2536,1162,2618]
# 每日分享
A_BENEFITS_SHARE = [38,376,1218,561]
A_Shared = [1089,566,1241,702]
A_BENEFITS_SHARE_Goto = [666,1774,1131,1892]

A_paizhao = [1045,2548,1213,2647]

A_paizhao_qiezi = [1035,1890,1124,1960]
A_paizhao_SHare = [96,2557,168,2620]

A_paizhao_SHare_QQShare = [549,2469,1263,2651]
A_paizhao_SHare_QQShare_close = [9,138,208,287]






# 商业街
A_SHOP = [5,507,205,700]
A_SHOP_Gift = [7,407,1249,2482]
A_buy = [664,2029,754,2082]
A_SHOP_A = [7,256,348,433]
A_SHOP_B = [294,256,636,435]
A_SHOP_huiyr = [582,246,933,423]
A_SHOP_zx = [153,1000,461,1364]
A_SHOP_zz = [769,1030,1133,1307]
A_SHOP_qd7 = [679,1320,872,1528]
A_SHOP_SIDE = [15,243,1244,433]


# 活动
A_ACTIVITY = [0,697,194,884]


# 盲盒
A_BLINDBOX = [0,892,200,1471]
BLINDBOX2 = [0,402,466,1107]
BLINDBOX2_JB = [1117,315,1186,362]

# 好友
A_FRIEND = [12,2015,179,2192]

# 点击summer
MSG_SUMMER = [246,300,1176,934]
# 点击领取
MSG_SUMMER_LQ = [924,840,1097,903]
# 点击空白
# 点击通讯录
TXL = [387,2382,617,2741]
# 点击一键赠送
TXL_yijianzengsong = [418, 2344, 771, 2434]
# 点击领取体力
TXL_LQtili = [831, 2342, 1194, 2440]
# 点击一键领取
TXL_YJLQ = [445,2042,807,2138]
# 点击空白
# 点击关闭
# 点击玩呐社区
wannashequ = [669,2528,887,2708]

# 点击金币
wannashequ_JB = [938,125,1138,279]

huati = [764,2536,982,2733]

huati_redpoint = [1054,236,1274,2422]
huati_JB = [1072,153,1217,256]



# 玩呐
A_PLAY = [174,2005,351,2197]
# 全服礼物
A_GIFT = [336,2013,518,2179]
# 点击左边开启
GIFT_LEFT = [271,1407,384,1507]
# 点击 空白
# 点击取消 / 发送
GIFT_CANLE = [212,1820,571,1916]
GIFT_SEND = [686,1815,1036,1906]
# 点击右边点击开启
GIFT_RIGHT= [882,1400,1000,1513]



# 日程
A_SCHEDULE = [1126,561,1267,715]




# 协会
A_UNION = [1120,707,1256,861]
# 点击灵感碰撞
lingganpengzhuang = [2,500,720,1061]
# 点击提交
TJ_1_SY = [302,850,445,929]
TJ_2_SS = [917,767,1053,843]
TJ_3_GX = [352,1707,498,1776]
TJ_4_CY = [1013,1640,1149,1714]
# 点击空白
# *5
# 点击开启企划（）
qihua = [831, 2570, 1186, 2680]
# 点击左上角返回
# 点击应援
yingyuan = [15,1061,374,1454]
# 点击立刻应援（普通）
likeyingyuan = [741, 1086, 1100, 1182]




# 收集
A_COLLECT = [1126,843,1269,1002]
# 点击金币
A_COLLECT_JB = [1069,297,1244,428]




# 闪亮之旅
A_LIGHT_IN_1 = [1,1169,810,2633]
A_LIGHT_IN_RICHENG = [1069,164,1228,348]
A_LIGHT = [852,2144,1197,2420]
# A 心意之期
A_A = [190,401,740,622]



# B 主线之旅
A_B = [641,766,1218,1069]



# C 代言女王
A_C = [58,653,574,1213]
meirixuanchuan = [1008,2420,1241,2685]
kashixuanchuan = [475, 1786, 837, 1886]
# 点击四大区域
SNE_1 = [744,893,1024,1129]
WST_2 = [881,1345,1176,1557]
YNS_3 = [452,1567,758,1766]
BBL_4 = [93,1268,382,1487]
# 点击一键拾取
yijianshiqu = [990, 2461, 1130, 2587]
daiyan = [920,2026,1103,2109]
A_BLANK = [141,1028,461,1138]


# D 思绪漫步
A_D = [684,1192,1203,1400]



# 点击每日练习
meirilianxi = [641, 1869, 960, 1982]
meirilianxi_lingqu = [743, 978, 887, 1063]


# E 日常事件簿
A_E = [851,402,1195,612]

# 点击金币
A_richangshijianbu_JB = [63,2344,166,2447]
richangshijianbu_JB = [79, 2371, 152, 2414]
# 点击空白
# 点击一键领取
richangshijianbu_rect = [224,2246,440,2452]
richangshijianbu_YJLQ = [262, 2288, 392, 2411]
richangshijianbu_LQ = [465, 1557, 787, 1644]
# 点击空白

#刷新
richangshijianbu_range = [959,392,1223,2418]
free_re_count =[797,2503,1244,2562]
richangshijianbu_re = [830,2566,1202,2675]

# 点击派遣
PQ_rect = [923,394,1244,2426]
PQ_1 = [994,740,1170,807]
PQ_2 = [990,1258,1166,1321]
PQ_3 = [991,1772,1161,1842]
PQ_4 = [991,2289,1168,2359]
# 点击一键派遣
YJPQ = [379,2577,734,2670]
# 点击确认派遣
QRPQ = [821,2574,1171,2673]
# *4
# 点击坐上返回


# F 时尚对决
A_F = [636,1495,923,1774]



# G 玩呐百科
# H 轻松一刻




A_MAIL = [218,205,600,371]




# 设计室
A_Other1 = [51,2461,248,2705]
# 家园
A_Other2 = [300,2474,487,2710]
# 衣橱
A_Other3 = [520,2456,756,2715]
# 羁绊
A_Other4 = [769,2449,1008,2741]
# 追光
A_Other5 = [1015,2459,1236,2721]
# 追光签到
A_Other5_QD = [2,623,297,941]
A_Other5_QD_JB = [1064,235,1259,435]
A_Other5_QD_DAY = [990,143,1259,238]